![title](./pic/renaming_combining/combining/join/1_title.png)

In [11]:
import pandas as pd

In [12]:
person = pd.DataFrame({'Name': ['Andreas', 'Monika', 'Gerald'], 
                       'Modell_Nr': ['2', '3', '1']})
person

      Name Modell_Nr
0  Andreas         2
1   Monika         3
2   Gerald         1

In [13]:
person = person.sample(frac=1)
person

      Name Modell_Nr
2   Gerald         1
0  Andreas         2
1   Monika         3

In [14]:
modelle = pd.DataFrame({'Modell_Nr': ['1', '2', '3'], 
                       'Modell': ['iPhone 13', 'Galaxy S21', 'Motorola']})
modelle

  Modell_Nr      Modell
0         1   iPhone 13
1         2  Galaxy S21
2         3    Motorola

In [15]:
modelle = modelle.sample(frac=1)
modelle

  Modell_Nr      Modell
0         1   iPhone 13
2         3    Motorola
1         2  Galaxy S21

<br>

Die `.join()`-Methode nimmt zwei `DataFrames` und verknüpft sie anhand ihrer Indizes oder einer ausgewählten Spalte. 

Hierbei will ich erwähnen, dass ich absichtlich auf die Funktion `.join()` nicht genauer eingehen werden. Alles was du mit der `.join()` machen kannst, kannst du feiner, zielgerichteter und übersichtlicher mit der `.merge()`-Methode machen, die wir uns im nächsten Kapitel mehr als ausführlich ansehen werden.

Kurz gesagt, hast du eine identische Spalte in zwei unterschiedlichen `DataFrames`, kannst du über diese Spalte mittels `.join()` einen schnellen Merge vornehmen.

---

## `.join()`

![title](./pic/renaming_combining/combining/join/2_join.png)

Verbinde Spalten mit anderen `DataFrames` entweder über den **Index**...

In [16]:
person.join(modelle, lsuffix='_person', rsuffix='_marken')

      Name Modell_Nr_person Modell_Nr_marken      Modell
2   Gerald                1                3    Motorola
0  Andreas                2                1   iPhone 13
1   Monika                3                2  Galaxy S21

---

... oder über eine **Schlüsselspalte**.

In [17]:
df_joined = person.join(modelle.set_index('Modell_Nr'), on='Modell_Nr')
df_joined

      Name Modell_Nr      Modell
2   Gerald         1   iPhone 13
0  Andreas         2  Galaxy S21
1   Monika         3    Motorola

In [18]:
df_joined.sort_index()

      Name Modell_Nr      Modell
0  Andreas         2  Galaxy S21
1   Monika         3    Motorola
2   Gerald         1   iPhone 13

***

### `lsuffix` & `rsuffix`

Bei mehr als einer gleichen Spalte

In [19]:
person = pd.DataFrame({'Name': ['Andreas', 'Monika', 'Gerald'], 
                       'Marken_Name': ['Samsung', 'Nokia', 'Apple'],
                       'Modell_Nr': ['2', '3', '1']})
person

      Name Marken_Name Modell_Nr
0  Andreas     Samsung         2
1   Monika       Nokia         3
2   Gerald       Apple         1

In [20]:
modelle = pd.DataFrame({'Modell_Nr': ['1', '2', '3'], 
                       'Marken_Name': ['Apple', 'Samsung', 'Nokia'],
                       'Modell': ['iPhone 13', 'Galaxy S21', 'Motorola']})
modelle

  Modell_Nr Marken_Name      Modell
0         1       Apple   iPhone 13
1         2     Samsung  Galaxy S21
2         3       Nokia    Motorola

In [21]:
df_joined = person.join(modelle.set_index('Modell_Nr'), on='Modell_Nr', lsuffix='_person', rsuffix='_modell')
df_joined

      Name Marken_Name_person Modell_Nr Marken_Name_modell      Modell
0  Andreas            Samsung         2            Samsung  Galaxy S21
1   Monika              Nokia         3              Nokia    Motorola
2   Gerald              Apple         1              Apple   iPhone 13

**Wichtig zu wissen ist:**

Bei der `.join()`-Methode wird immer das komplette linke `DataFrame` dem neuen `DataFrame` angefügt. Die Einträge des rechten `DataFrames` werden nur dem linken angefügt, wenn es passende Werte über die zu mergende Spalte findet.
Können keine passenden Schlüssel gematched werden, werden die entsprechenden Teile des rechten `DataFrames` verworfen.

Wenn du mehr zu `LEFT JOIN`, `RIGHT JOIN`, `INNER JOIN` oder `OUTER JOIN` wissen willst, schau dir die Definitionen im Kapitel zur `.merge()`-Funktion an.